import ArchivingTemplate from "./ArchivingTemplate";

const Tistory = () => {
  return (
    <ArchivingTemplate
      logo={
        <svg xmlns="http://www.w3.org/2000/svg" width="36" height="36" viewBox="0 0 459 459">
          <path d="M229.5,0C102.75,0,0,102.75,0,229.5S102.75,459,229.5,459,459,356.25,459,229.5,356.25,0,229.5,0ZM130.21,191.45a39.57,39.57,0,1,1,39.56-39.57A39.58,39.58,0,0,1,130.21,191.45ZM229.5,390a39.56,39.56,0,1,1,39.56-39.56A39.56,39.56,0,0,1,229.5,390Zm0-99.29a39.56,39.56,0,1,1,39.56-39.56A39.56,39.56,0,0,1,229.5,290.74Zm0-99.29a39.57,39.57,0,1,1,39.56-39.57A39.57,39.57,0,0,1,229.5,191.45Zm99.29,0a39.57,39.57,0,1,1,39.57-39.57A39.57,39.57,0,0,1,328.79,191.45Z" />
        </svg>
      }
      title="TISTORY"
      link="https://nno3onn.tistory.com"
      description="기록용 개발 블로그"
    >
      <ul>
        <li>배운 것을 진정으로 나의 것을 만들기 위한 기록</li>
        <li>개발 과정에서 개인적으로 궁금했던 지식들 정리</li>
        <li>교육 프로그램 수강 과정에서 배우고 느낀 점들 정리</li>
        <li>프로젝트 진행 시 이슈 해결 및 개발 과정 기록</li>
      </ul>
    </ArchivingTemplate>
  );
};

export default Tistory;
